EmptyProject/src/Documents/ПоступлениеТовара/ПоступлениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовара</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенлатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EmptyProject/src/Documents/ПоступлениеТовара/Forms/ФормаДокумента/Module.bsl
//@strict-types

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Поменялась сильно цена";
	РассчитатьСуммуСтроки(ТекстПользователю, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Поменялось количество";
	РассчитатьСуммуСтроки(ТекстПользователю, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Текст, Сообщение)
	Сообщение.Сумма = Сообщение.Количество * Сообщение.Цена;
	Сообщить(Текст);
	Человек = ОписаниеСотрудника();
	Сообщить(Человек.Имя);
КонецПроцедуры

Функция ОписаниеСотрудника()
	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Имя", "Антон");
	Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	Сотрудник.Вставить("Стаж", 15);
	Сотрудник.Вставить("Штатный", Ложь);
	Возврат Сотрудник;
	
	//Сотрудник = Новый Соответствие;
	//Сотрудник.Вставить("Имя", "Антон");
	//Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	//Сотрудник.Вставить("Стаж", 15);
	//Сотрудник.Вставить("Штатный", Ложь);
	//Возврат Сотрудник;
	
//Сотрудник = Новый Структура("Имя, ДатаРождения, Стаж, Штатный");
	
	
	
КонецФункции
